# Transparency Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..Transparency Property
OverrideGraphicSettings Class See Also
---
Transparency of surfaces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Transparency { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Transparency As Integer
	Get
```

Visual C++
---
```text
public:
property int Transparency {
	int get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace